<template>
  <com-page-navbar-wrapper title="用户服务协议">
    <div class="protocol">
      <h2 class="article-title">中竞网用户服务协议</h2>
      <div class="protocol__title">前言</div>
      <div>欢迎您使用中竞网的服务! </div>
      <div>为便于您更好地使用中竞网的服务，您应当阅读并遵守《中竞网用户服务协议》(以下简称
      “本协议”)。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款。
      限制、免责条款可能以黑体加粗形式提示您注意。</div>
      <div>除非您已阅读并接受本协议所有条款，否则您无权使用中竞网提供的服务。您使用中竞网
      的服务即视为您已阅读并同意上述协议的约束，用户不应再以不了解本协议内容为由拒绝
      履行本协议,因此，为保障您的权益，请于注册使用中竞网所提供的各种产品和服务之前，
      仔细阅读本协议全文。 </div>
      <div>如果您未满 18 周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条
      款。 </div>
      <div class="protocol__title">一、协议的范围 </div>
      <div>1. 本协议是您与中竞网之间关于用户使用中竞网相关服务所订立的协议。“中竞网”是指广
      东中竞电子竞技有限公司及其相关服务可能存在的运营关联单位。“用户”是指使用中竞网
      相关服务的使用人，在本协议中更多地称为“您”。 </div>
      <div>2. 本协议项下的具体服务内容是指中竞网根据实际情况，向用户提供的包括但不限于虚拟
      物品交易商城、游戏竞猜、赛事参与平台、游戏论坛(BBS)、新闻评论和广告等产品及服务
      (以下简称“本服务”)。 </div>
      <div>3.您承诺以真实身份注册成为甲方用户，并保证所提供的个人身份资料信息真实、完整、
      有效，依据法律规定和必备条款约定对所提供的信息承担相应的法律责任。 
      4.您以真实身份注册成为中竞网用户后，需要修改个人身份资料信息，中竞网应当及时、
      有效地为其提供该项服务</div>
        <div class="protocol__title">二、帐号与密码安全  </div>
        <div>1. 您在使用中竞网的服务时可能需要注册一个帐号。中竞网特别提醒您应妥善保管您的帐
      号和密码。当您使用完毕后，应安全退出。因您保管不善可能导致遭受盗号或密码失窃，
      责任由您自行承担。 </div>
      <div>2. 您不应将自己的帐号、密码转让或出借予他人使用。如您发现自己的帐号遭他人非法使
      用，应立即通知中竞网。并有权通知中竞网采取措施暂停该账号的登录和使用。同时，您
      也应向中竞网提供与被停用账号注册信息相一致的个人有效身份信息。中竞网核实您所提
      供的个人有效身份信息与所注册的身份信息相一致的，应当及时采取措施暂停该账号的登
      录和使用。中竞网违反前述约定，未及时采取措施暂停用户账号的登录和使用，因此而给
      您造成损失的，将有中竞网承担。若您没有提供个人有效身份证件或者用户提供的个人有
      效身份信息与所注册的身份信息不一致的，中竞网有权拒绝用户上述请求。此外，因黑客
      行为或您的保管疏忽导致帐号、密码遭他人非法使用，中竞网不承担任何责任。 </div>
      <div>3. 您注册的帐号自注册起 90 天内或连续 365 天，没有使用过该帐号(包括使用该帐号登录
      网站、充值)，则中竞网有权删除该帐号，包括但不限于注册信息、等级信息、物品信息等
      一切与该注册帐号相关的信息， </div>
      <div class="protocol__title">三、用户账号使用与保管 </div>
      <div>1. 根据必备条款的约定，中竞网有权审查您注册所提供的身份信息是否真实、有效，并应
      积极地采取技术与管理等合理措施保障您账号的安全、有效;您有义务妥善保管账号及密
      码，并正确、安全地使用账号及密码。任何一方未尽上述义务导致账号密码遗失、账号被
      盗等情形而给您和他人的民事权利造成损害的，应当承担由此产生的法律责任</div>
      <div>2.您对登录后所持账号产生的行为依法享有权利和承担责任。 </div>
      <div>3.您发现其账号或密码被他人非法使用或有使用异常的情况的，应及时根据中竞网公布的
      处理方式通知中竞网，并有权通知中竞网采取措施暂停该账号的登录和使用。 </div>
      <div>4. 中竞网根据您的通知采取措施暂停您账号的登录和使用的，中竞网应当要求您提供并核
      实与其注册身份信息相一致的个人有效身份信息。 </div>
      <div>4.1 中竞网核实您所提供的个人有效身份信息与所注册的身份信息相一致的，应当及时采
      取措施暂停您账号的登录和使用。 </div>
      <div>4.2 中竞网违反本条 4.1 款项的约定，未及时采取措施暂停您账号的登录和使用，因此而
      给您造成损失的，应承担相应的法律责任。 </div>
      <div>4.3 您没有提供其个人有效身份证件或者您提供的个人有效身份证件与所注册的身份信息
      不一致的，中竞网有权拒绝您上述请求。 </div>
      <div>5 您为了维护其合法权益，向中竞网提供与所注册的身份信息相一致的个人有效身份信息
      时，中竞网应当为您提供账号注册人证明、原始注册信息等必要的协助和支持，并根据需
      要向有关行政机关和司法机关提供相关证据信息资料。 </div>
      <div class="protocol__title">四、用户个人信息保护  </div>
      <div>1. 保护您的个人信息是中竞网的一项基本原则。 </div>
      <div>2. 您在注册帐号或使用本服务的过程中，可能需要填写一些必要的信息。若国家法律法规
      有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则无法使用本服务
      或在使用过程中受到限制。 </div>
      <div>3. 一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别(如号码申
      诉服务)的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。 </div>
      <div>4. 中竞网将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受
      未经授权的访问、使用或披露。 </div>
      <div>5. 未经您的同意，中竞网不会向中竞网以外的任何公司、组织和个人披露您的个人信息，
      但法律法规另有规定的除外。 </div>
      <div>6. 中竞网非常重视对未成年人个人信息的保护。若您是 18 周岁以下的未成年人，在使用
      中竞网的服务前，应事先取得您家长或法定监护人(以下简称"监护人")的书面同意。 </div>
      <div>7. 未经您许可中竞网不得向任何第三方提供、公开或共享您注册资料中的姓名、个人有效
      身份证件号码、联系方式、家庭住址等个人身份信息，但下列情况除外： </div>
      <div>7.1 您或您监护人授权中竞网披露的; </div>
      <div>7.2 有关法律要求中竞网披露的; </div>
      <div>7.3 司法机关或行政机关基于法定程序要求中竞网提供的; </div>
      <div>7.4 中竞网为了维护自己合法权益而向您提起诉讼或者仲裁时; </div>
      <div>7.5 应您监护人的合法要求而提供您个人身份信息时。 </div>
      <div class="protocol__title">五、使用本服务的方式   </div>
      <div>1. 您对登录后所持账号产生的行为依法享有权利和承担责任 </div>
      <div>2. 除非您与中竞网另有约定，您同意本服务仅为您个人使用。 </div>
      <div>3. 您应当通过中竞网提供或认可的方式使用本服务。您依本协议条款所取得的权利不可转
      让。 </div>
      <div>4. 您不得使用未经中竞网授权的插件、外挂或第三方工具对本协议项下的服务进行干扰、
      破坏、修改或施加其他影响。 </div>
      <div>5. 您通过服务对程序的使用受制于某些已经包含在规则中的行为准则。这些规则将在中竞
    网官方网站公开并不定期更新，所有通过服务使用程序的用户必须遵守。您有义务知晓、
    了解并遵守这些行为规则。中竞网保留权利决定何种行为违反游戏精神，并对该等行为采
    取其认为合适的相应的处理措施(包括但不限于警告、扣除虚拟货币、暂时或永久冻结账
    号、拒绝提供服务等)。中竞网保留随时修改这些行为规则的权利。 </div>
      <div class="protocol__title">六、按现状提供服务 </div>
      <div>您理解并同意，中竞网的服务是按照现有技术和条件所能达到的现状提供的。中竞网会尽
    最大努力向您提供服务，确保服务的连贯性和安全性;但中竞网不能随时预见和防范法律、
    技术以及其他风险，包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、第三
    方服务瑕疵、政府行为等原因可能导致的服务中断、数据丢失以及其他的损失和风险。</div>
      <div class="protocol__title">七、自备设备  </div>
      <div>1. 您应当理解，您使用中竞网的服务需自行准备与相关服务有关的终端设备(如电脑、调制
      解调器等装置)，并承担所需的费用(如电话费、上网费等费用)。 </div>
      <div>2. 您理解并同意，您使用本服务时会耗用您的终端设备和带宽等资源。 </div>
      <div class="protocol__title">八、广告条款   </div>
      <div>1. 您理解并同意，中竞网可以在提供服务的过程中自行或由第三方广告商向您发送广告、
      推广或宣传信息(包括商业与非商业信息)，其方式和范围可不经向您特别通知而变更。 </div>
      <div>2. 中竞网依照法律的规定对广告商履行相关义务，您应当自行判断广告信息的真实性并为
      自己的判断行为负责，除法律明确规定外，您因依该广告信息进行的交易或前述广告商提
      供的内容而遭受的损失或损害，中竞网不承担责任。 </div>
      <div class="protocol__title">九、收费服务    </div>
      <div>1. 中竞网的部分服务是以收费方式提供的，相关页面上会有明确的提示，如您使用收费服
      务，请遵守相关的协议，如您不同意支付该等费用，可选择不接受相应的产品和服务。 </div>
      <div>2. 中竞网可能根据实际需要对收费服务的收费标准、方式进行修改和变更，中竞网也可能
      会对部分免费服务开始收费。前述修改、变更或开始收费前，中竞网将在相应服务页面进
      行通知或公告。如果您不同意上述修改、变更或付费内容，则应停止使用该服务。 </div>
      <div class="protocol__title">十、第三方提供的产品或服务     </div>
      <div>您在中竞网平台上使用第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三
      方的用户协议。中竞网和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责
      任。 </div>
      <div class="protocol__title">十一、本服务中的软件 </div>
      <div>1. 您在使用本服务的过程中可能需要下载软件，对于这些软件，中竞网给予您一项个人
      的、不可转让及非排他性的许可。您仅可为访问或使用本服务的目的而使用这些软件。 </div>
      <div>2. 为了改善用户体验、保证服务的安全性及产品功能的一致性，中竞网可能会对软件进行
      更新。您应该将相关软件更新到最新版本，否则中竞网并不保证其能正常使用。 </div>
      <div class="protocol__title">十二、知识产权声明  </div>
      <div>1. 中竞网在本服务中提供的内容(包括但不限于网页、文字、图片、音频、视频、图表等)
      的知识产权归中竞网所有，您在使用本服务中所产生的内容的知识产权归您或相关权利人
      所有。 </div>
      <div>2. 除另有特别声明外，中竞网提供本服务时所依托软件的著作权、专利权及其他知识产权
      均归中竞网所有。 </div>
      <div>3. 中竞网在本服务中所使用的“竞猜币”、“竞币”、“中竞网”及中竞网 logo 形象等商业标
      识，其著作权或商标权归中竞网所有。 </div>
      <div>4. 上述及其他任何本服务包含的内容的知识产权均受到法律保护，未经中竞网、您个人或
      相关权利人书面许可，任何人不得以任何形式进行使用或创造相关衍生作品。 </div>
      <div class="protocol__title">十三、用户违法行为 </div>
      <div>1. 您在使用本服务时须遵守法律法规，不得利用本服务从事违法违规行为，包括但不限
      于： </div>
      <div>( 1 )发布、传送、传播、储存危害国家安全统一、破坏社会稳定、违反公序良俗、侮辱、
      诽谤、淫秽、暴力以及任何违反国家法律法规的内容; </div>
      <div>( 2 )发布、传送、传播、储存侵害他人知识产权、商业秘密等合法权利的内容; </div>
      <div>( 3 )恶意虚构事实、隐瞒真相以误导、欺骗他人; </div>
      <div>( 4 )发布、传送、传播广告信息及垃圾信息; </div>
      <div>( 5 )其他法律法规禁止的行为。 </div>
      <div>2. 如果您违反了本条约定，相关国家机关或机构可能会对您提起诉讼、罚款或采取其他制
      裁措施，并要求中竞网给予协助。造成损害的，您应依法予以赔偿，中竞网不承担任何责
      任。</div>
      <div>3. 如果中竞网发现或收到他人举报您发布的信息违反本条约定，中竞网有权进行独立判断
      并采取技术手段予以删除、屏蔽或断开链接。同时，中竞网有权视您的行为性质，采取包
      括但不限于暂停或终止服务，限制、冻结或终止 VP 账号使用，追究法律责任等措施。 </div>
      <div>4. 您违反本条约定，导致任何第三方损害的，您应当独立承担责任;中竞网因此遭受损失
      的，您也应当一并赔偿。 </div>
      <div class="protocol__title">十四、遵守当地法律监管  </div>
      <div>1. 您在使用本服务过程中应当遵守当地相关的法律法规，并尊重当地的道德和风俗习惯。
      如果您的行为违反了当地法律法规或道德风俗，您应当为此独立承担责任。 </div>
      <div>2. 您应避免因使用本服务而使中竞网卷入政治和公共事件，否则中竞网有权暂停或终止对
      您的服务。 </div>
      <div class="protocol__title">十五、用户发送、传播的内容与第三方投诉处理  </div>
      <div>1. 您通过本服务发送或传播的内容(包括但不限于网页、文字、图片、音频、视频、图表
      等)均由您自行承担责任。 </div>
      <div>2. 您发送或传播的内容应有合法来源，相关内容为您所有或您已获得权利人的授权。 </div>
      <div>3. 您同意中竞网可为履行本协议或提供本服务的目的而使用您发送或传播的内容。 </div>
      <div>4. 如果中竞网收到权利人通知，主张您发送或传播的内容侵犯其相关权利的，您同意中竞
      网有权进行独立判断并采取删除、屏蔽或断开链接等措施。 </div>
      <div class="protocol__title">十六、不可抗力及其他免责事由   </div>
      <div>1. 您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发
      生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客
      观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、
      动乱、政府行为等。出现上述情况时，中竞网将努力在第一时间与相关单位配合，及时进
      行修复，但是由此给您造成的损失中竞网在法律允许的范围内免责。 </div>
      <div>2. 在法律允许的范围内，中竞网对以下情形导致的服务中断或受阻不承担责任： </div>
      <div>( 1 )受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏; </div>
      <div>( 2 )您或中竞网的电脑软件、系统、硬件和通信线路出现故障; </div>
      <div>( 3 )您操作不当; </div>
      <div>( 4 )您通过非中竞网授权的方式使用本服务; </div>
      <div>3. 您理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风
      险，中竞网不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造
      成的损害负责。这些风险包括但不限于： </div>
      <div>4. 来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息; </div>
      <div>5. 因使用本协议项下的服务，遭受他人误导、欺骗或其他导致或可能导致的任何心理、生
      理上的伤害以及经济上的损失; </div>
      <div>6. 其他因网络信息或用户行为引起的风险。 </div>
      <div>7. 您理解并同意，本服务并非为某些特定目的而设计，包括但不限于核设施、军事用途、
      医疗设施、交通通讯等重要领域。如果因为软件或服务的原因导致上述操作失败而带来的
      人员伤亡、财产损失和环境破坏等，中竞网不承担法律责任。 </div>
      <div>8. 中竞网依据本协议约定获得处理违法违规内容的权利，该权利不构成中竞网的义务或承
      诺，中竞网不能保证及时发现违法行为或进行相应处理。 </div>
      <div>9. 在任何情况下，您不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作
      的，请一定先核实对方身份，并请经常留意中竞网有关防范诈骗犯罪的提示。 </div>
      <div class="protocol__title">十七、协议的生效与变更</div>
      <div>1. 您使用中竞网的服务即视为您已阅读本协议并接受本协议的约束。 </div>
      <div>2. 中竞网有权在必要时修改本协议条款。您可以在相关服务页面查阅最新版本的协议条
      款。 </div>
      <div>3. 本协议条款变更后，如果您继续使用中竞网提供的软件或服务，即视为您已接受修改后
      的协议。如果您不接受修改后的协议，应当停止使用中竞网提供的软件或服务。 </div>
      <div class="protocol__title">十八、服务的变更、中断或终止 </div>
      <div>1. 鉴于网络服务的特殊性，您同意中竞网有权随时变更、中断或终止部分或全部的网络服
      务(包括收费网络服务)。如变更、中断或终止的网络服务属于免费网络服务，中竞网无需
      通知您，也无需对您或任何第三方承担任何责任;如变更、中断或终止的网络服务属于收费
      网络服务，中竞网应当在变更、中断或终止之前事先通知您，并应向您提供等值的替代性
      的收费网络服务，如您不愿意接受替代性的收费网络服务，就您已经向中竞网支付的服务
      费，中竞网应当按照您实际使用相应收费网络服务的情况扣除相应服务费之后将剩余的服
      务费退还给您</div>
      <div>2. 您理解并同意，中竞网需要定期或不定期地对提供网络服务的平台(如互联网网站、移动
      网络等)或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内
      的中断，中竞网无需为此承担任何责任，但中竞网将尽可能事先进行通告。 </div>
      <div>3. 中竞网服务(尤指但不仅指中竞网平台及附带相关软件)的各个新版本，中竞网可以自行
      决定是否保留为中竞网服务增加附加特点和功能，或者提供程序编程之修补、更新和升级
      的权利。中竞网无需向您发出通知即可自行决定修改、停止或暂停您对任何版本中竞网服
      务的使用，和/或禁用您已经使用或安装的中竞网服务，以便对相关技术进行检修、改良和
      /或升级，或者出于其他合理原因;对于由发行和/或不发行中竞网服务的新版本而导致的直
      接或间接损害，威佩将不承担任何赔偿责任。 </div>
      <div>4. 如发生下列任何一种情形，中竞网有权不经通知立即中断或终止向您提供的服务： </div>
      <div>( 1 )根据法律规定您应提交真实信息，而您提供的个人资料不真实、或与注册时信息不一
      致又未能提供合理证明; </div>
      <div>( 2 ) 您有发布违法信息、严重违背社会公德、其他违反法律禁止性规定或违反本协议约定
      的行为; </div>
      <div>( 3 )按照法律规定或主管部门的要求; </div>
      <div>( 4 )出于安全的原因或其他必要的情形。</div>
      <div>5. 您在接受中竞网服务时实施不正当行为的，中竞网有权终止对您提供服务。该不正当行
      为的具体情形应当在本协议中有明确约定或属于中竞网事先明确告知的应被终止服务的禁
      止性行为，否则，中竞网不得终止对您提供服务; </div>
      <div>6. 您提供虚假注册身份信息，或实施违反本协议的行为，中竞网有权中止对您提供全部或
      部分服务;中竞网采取中止措施应当通知您并告知中止期间，中止期间应该是合理的，中止
      期间届满中竞网应当及时恢复对您的服务; </div>
      <div>7. 中竞网有权按本协的约定进行收费。若您未按时足额付费，中竞网有权中断、中止或终
      止提供服务。 </div>
      <div>8. 您有责任自行备份存储在本服务中的数据。如果您的服务被终止，中竞网可以从服务器
      上永久地删除您的数据。服务终止后，中竞网没有义务向您返还数据。</div>
      <div class="protocol__title">十九、管辖与法律适用</div>
      <div>1. 本协议签订地为中华人民共和国广东东莞。 </div>
      <div>2. 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律(不包
      括冲突法)。 </div>
      <div>3. 若您和中竞网之间发生任何纠纷或争议，首先应友好协商解决;协商不成的，您同意将纠
      纷或争议提交本协议签订地有管辖权的人民法院管辖。 </div>
      <div>4. 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的
        依据。 </div>
      <div>5. 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束
      力。 </div>
      <div class="protocol__title">二十、未成年人使用条款 </div>
      <div>1. 不论你的父母或监护人是否同意，你都必须是十八周岁以上才能使用本网站的服务。 </div>
      <div>2. 未成年人用户涉世未深，容易被网络虚象迷惑，且好奇心强，遇事缺乏随机应变的处理
      能力，很容易被别有用心的人利用而又缺乏自我保护能力。因此，未成年人用户在使用本
      服务时应注意以下事项，提高安全意识，加强自我保护：</div>
      <div>3. 认清网络世界与现实世界的区别，避免沉迷于网络，影响日常的学习生活; </div>
      <div>4. 填写个人资料时，加强个人保护意识，以免不良分子对个人生活造成骚扰; </div>
      <div>5. 在监护人或老师的指导下，学习正确使用网络; </div>
      <div>6. 避免陌生网友随意会面或参与联谊活动，以免不法分子有机可乘，危及自身安全。 </div>
      <div>7. 监护人、学校均应对未成年人使用本服务时多做引导。特别是家长应关心子女的成长，
      注意与子女的沟通，指导子女上网应该注意的安全问题，防患于未然。 </div>
      <div class="protocol__title">二十一、特别声明  </div>
      <div>
        <strong>中竞网及其关联平台提供的服务包括但不限于所有竞猜预测均只为休闲娱乐，增加比赛趣
        味性，所有虚拟货币和积分均不能兑换为现金。 </strong>
      </div>
      <div class="protocol__title">二十二、最终解释权   </div>
      <div>1. 本协议最终解释权归广东中竞电子竞技有限公司所有。 </div>
      <div>2. 中竞网保留对规则的最终解释权以及随时修改规则的必要。 </div>
    </div>
  </com-page-navbar-wrapper>
</template>

<style lang="scss" scoped>
  .protocol {
    padding: 0 20px 40px;
    line-height: 22px;
    height: 100%;
    overflow-y: auto;
  }
  .article-title {
    padding: 20px 0;
    font-size: 18px;
    font-weight: 700;
    text-align: center;
  }
  .protocol__title {
    padding: 20px 0;
    font-size: 16px;
    font-weight: 700;
    text-align: center;
  }
</style>
